{
  "0x00000000": "The PicoScope is functioning correctly.",
  "0x00000001": "An attempt has been made to open more than <API>_MAX_UNITS.",
  "0x00000002": "Not enough memory could be allocated on the host machine.",
  "0x00000003": "No Pico Technology device could be found.",
  "0x00000004": "Unable to download firmware.",
  "0x00000005": "The driver is busy opening a device.",
  "0x00000006": "An unspecified failure occurred.",
  "0x00000007": "The PicoScope is not responding to commands from the PC.",
  "0x00000008": "The configuration information in the PicoScope is corrupt or missing.",
  "0x00000009": "The picopp.sys file is too old to be used with the device driver.",
  "0x0000000A": "The EEPROM has become corrupt, so the device will use a default setting.",
  "0x0000000B": "The operating system on the PC is not supported by this driver.",
  "0x0000000C": "There is no device with the handle value passed.",
  "0x0000000D": "A parameter value is not valid.",
  "0x0000000E": "The timebase is not supported or is invalid.",
  "0x0000000F": "The voltage range is not supported or is invalid.",
  "0x00000010": "The channel number is not valid on this device or no channels have been set.",
  "0x00000011": "The channel set for a trigger is not available on this device.",
  "0x00000012": "The channel set for a condition is not available on this device.",
  "0x00000013": "The device does not have a signal generator.",
  "0x00000014": "Streaming has failed to start or has stopped without user request.",
  "0x00000015": "Block failed to start - a parameter may have been set wrongly.",
  "0x00000016": "A parameter that was required is NULL.",
  "0x00000017": "The current functionality is not available while using ETS capture mode.",
  "0x00000018": "No data is available from a run block call.",
  "0x00000019": "The buffer passed for the information was too small.",
  "0x0000001A": "ETS is not supported on this device.",
  "0x0000001B": "The auto trigger time is less than the time it will take to collect the pre-trigger data.",
  "0x0000001C": "The collection of data has stalled as unread data would be overwritten.",
  "0x0000001D": "Number of samples requested is more than available in the current memory segment.",
  "0x0000001E": "Not possible to create number of segments requested.",
  "0x0000001F": "A null pointer has been passed in the trigger function or one of the parameters is out of range.",
  "0x00000020": "One or more of the hold-off parameters are out of range.",
  "0x00000021": "One or more of the source details are incorrect.",
  "0x00000022": "One or more of the conditions are incorrect.",
  "0x00000023": "The driver's thread is currently in the <API>Ready callback function and therefore the action cannot be carried out.",
  "0x00000024": "An attempt is being made to get stored data while streaming. Either stop streaming by calling <API>Stop, or use <API>GetStreamingLatestValues.",
  "0x00000025": "Data is unavailable because a run has not been completed.",
  "0x00000026": "The memory segment index is out of range.",
  "0x00000027": "The device is busy so data cannot be returned yet.",
  "0x00000028": "The start time to get stored data is out of range.",
  "0x00000029": "The information number requested is not a valid number.",
  "0x0000002A": "The handle is invalid so no information is available about the device. Only PICO_DRIVER_VERSION is available.",
  "0x0000002B": "The sample interval selected for streaming is out of range.",
  "0x0000002C": "ETS is set but no trigger has been set. A trigger setting is required for ETS.",
  "0x0000002D": "Driver cannot allocate memory.",
  "0x0000002E": "Incorrect parameter passed to the signal generator.",
  "0x0000002F": "Conflict between the shots and sweeps parameters sent to the signal generator.",
  "0x00000030": "A software trigger has been sent but the trigger source is not a software trigger.",
  "0x00000031": "An <API>SetTrigger call has found a conflict between the trigger source and the AUX output enable.",
  "0x00000032": "ETS mode is being used and AUX is set as an input.",
  "0x00000033": "Attempt to set different EXT input thresholds set for signal generator and oscilloscope trigger.",
  "0x00000034": "An <API>SetTrigger... function has set AUX as an output and the signal generator is using it as a trigger.",
  "0x00000035": "The combined peak-to-peak voltage and the analog offset voltage exceed the maximum voltage the signal generator can produce.",
  "0x00000036": "NULL pointer passed as delay parameter.",
  "0x00000037": "The buffers for overview data have not been set while streaming.",
  "0x00000038": "The analog offset voltage is out of range.",
  "0x00000039": "The analog peak-to-peak voltage is out of range.",
  "0x0000003A": "A block collection has been cancelled.",
  "0x0000003B": "The segment index is not currently being used.",
  "0x0000003C": "The wrong GetValues function has been called for the collection mode in use.",
  "0x0000003D": "Get values interrupted",
  "0x0000003F": "The function is not available.",
  "0x00000040": "The aggregation ratio requested is out of range.",
  "0x00000041": "Device is in an invalid state.",
  "0x00000042": "The number of segments allocated is fewer than the number of captures requested.",
  "0x00000043": "A driver function has already been called and not yet finished. Only one call to the driver can be made at any one time.",
  "0x00000044": "Not used.",
  "0x00000045": "An invalid coupling type was specified in <API>SetChannel.",
  "0x00000046": "An attempt was made to get data before a data buffer was defined.",
  "0x00000047": "The selected downsampling mode (used for data reduction) is not allowed.",
  "0x00000048": "Aggregation was requested in rapid block mode.",
  "0x00000049": "An invalid parameter was passed to <API>SetTriggerChannelProperties(V2).",
  "0x0000004A": "The driver was unable to contact the oscilloscope.",
  "0x0000004B": "Resistance-measuring mode is not allowed in conjunction with the specified probe.",
  "0x0000004C": "The device was unexpectedly powered down.",
  "0x0000004D": "A problem occurred in <API>SetSigGenBuiltIn or <API>SetSigGenArbitrary.",
  "0x0000004E": "FPGA not successfully set up.",
  "0x0000004F": "Power manager",
  "0x00000050": "An impossible analog offset value was specified in <API>SetChannel.",
  "0x00000051": "There is an error within the device hardware.",
  "0x00000052": "There is an error within the device hardware.",
  "0x00000053": "Unable to configure the signal generator.",
  "0x00000054": "The FPGA cannot be initialized, so unit cannot be opened.",
  "0x00000056": "The frequency for the external clock is not within 15% of the nominal value.",
  "0x00000057": "The FPGA could not lock the clock signal.",
  "0x00000058": "You are trying to configure the AUX input as both a trigger and a reference clock.",
  "0x00000059": "You are trying to configure the AUX input as both a pulse width qualifier and a reference clock.",
  "0x0000005A": "The requested scaling file cannot be opened.",
  "0x0000005B": "The frequency of the memory is reporting incorrectly.",
  "0x0000005C": "The I2C that is being actioned is not responding to requests.",
  "0x0000005D": "There are no captures available and therefore no data can be returned.",
  "0x0000005E": "The capture mode the device is currently running in does not support the current request.",
  "0x0000005F": "The number of trigger channels is greater than 4, except for a PicoScope 4824 where 8 channels are allowed for rising/falling/rising_or_falling trigger directions.",
  "0x00000060": "If you have specified a trigger direction which is not allowed, for example specifying PICO_ABOVE without another condition which crosses a threshold on another channel.",
  "0x00000061": "When more than 4 trigger channels are set and their trigger condition states are not <API>_CONDITION_TRUE.",
  "0x00000103": "Get data active",
  "0x00000104": "Codes 104 to 10B are used by the PT104 (USB) when connected via the Network Socket. The device is currently connected via the IP Network socket and thus the call made is not supported.",
  "0x00000105": "An incorrect IP address has been passed to the driver.",
  "0x00000106": "The IP socket has failed.",
  "0x00000107": "The IP socket has timed out.",
  "0x00000108": "Failed to apply the requested settings.",
  "0x00000109": "The network connection has failed.",
  "0x0000010A": "Unable to load the WS2 DLL.",
  "0x0000010B": "The specified IP port is invalid.",
  "0x0000010C": "The type of coupling requested is not supported on the opened device.",
  "0x0000010D": "Bandwidth limiting is not supported on the opened device.",
  "0x0000010E": "The value requested for the bandwidth limit is out of range.",
  "0x0000010F": "The arbitrary waveform generator is not supported by the opened device.",
  "0x00000110": "Data has been requested with ETS mode set but run block has not been called, or stop has been called.",
  "0x00000111": "White noise output is not supported on the opened device.",
  "0x00000112": "The wave type requested is not supported by the opened device.",
  "0x00000113": "The requested digital port number is out of range (MSOs only).",
  "0x00000114": "The digital channel is not in the range <API>_DIGITAL_CHANNEL0 to <API>_DIGITAL_CHANNEL15, the digital channels that are supported.",
  "0x00000115": "The digital trigger direction is not a valid trigger direction and should be equal in value to one of the <API>_DIGITAL_DIRECTION enumerations.",
  "0x00000116": "Signal generator does not generate pseudo-random binary sequence.",
  "0x00000117": "When a digital port is enabled, ETS sample mode is not available for use.",
  "0x00000118": "There has been no new sample taken, this value has already been returned previously.",
  "0x00000119": "The DC power supply is connected.",
  "0x0000011A": "The DC power supply is not connected. For many 4+ Channel devices this will mean a restricted feature set is offered e.g. for a 4 channel device - C and D are usually disabled. Check the respective API programmers guide of your device for the full details.",
  "0x0000011B": "Incorrect power mode passed for current power source.",
  "0x0000011C": "The supply voltage from the USB source is too low.",
  "0x0000011D": "The oscilloscope is in the process of capturing data.",
  "0x0000011E": "A USB 3.0 device is connected to a non-USB 3.0 port.",
  "0x0000011F": "A function has been called that is not supported by the current device.",
  "0x00000120": "The device resolution is invalid (out of range).",
  "0x00000121": "The number of channels that can be enabled is limited in 15 and 16-bit modes. (Flexible Resolution Oscilloscopes only)",
  "0x00000122": "USB power not sufficient for all requested channels.",
  "0x00000123": "The signal generator does not have a configurable DC offset.",
  "0x00000124": "An attempt has been made to define pre-trigger delay without first enabling a trigger.",
  "0x00000125": "An attempt has been made to define pre-trigger delay without first arming a trigger.",
  "0x00000126": "Pre-trigger delay and post-trigger delay cannot be used at the same time.",
  "0x00000127": "The array index points to a nonexistent trigger.",
  "0x00000128": "Awg clock frequency",
  "0x00000129": "There are more than 4 analog channels with a trigger condition set.",
  "0x0000012A": "The condition parameter is a null pointer.",
  "0x0000012B": "There is more than one condition pertaining to the same channel.",
  "0x0000012C": "The parameter relating to condition information is out of range.",
  "0x0000012D": "Reading the meta data has failed.",
  "0x0000012E": "Writing the meta data has failed.",
  "0x0000012F": "A parameter has a value out of the expected range.",
  "0x00000130": "The driver does not support the hardware variant connected.",
  "0x00000131": "The driver does not support the digital hardware variant connected.",
  "0x00000132": "The driver does not support the analog hardware variant connected.",
  "0x00000133": "Converting a channel's ADC value to resistance has failed.",
  "0x00000134": "The channel is listed more than once in the function call.",
  "0x00000135": "The range cannot have resistance conversion applied.",
  "0x00000136": "An invalid value is in the max buffer.",
  "0x00000137": "An invalid value is in the min buffer.",
  "0x00000138": "When calculating the frequency for phase conversion, the frequency is greater than that supported by the current variant.",
  "0x00000139": "The device's EEPROM is corrupt. Contact Pico Technology support: https://www.picotech.com/tech-support.",
  "0x0000013A": "The EEPROM has failed.",
  "0x0000013B": "The serial buffer is too small for the required information.",
  "0x0000013C": "The signal generator trigger and the external clock have both been set. This is not allowed.",
  "0x0000013D": "The AUX trigger was enabled and the external clock has been enabled, so the AUX has been automatically disabled.",
  "0x0000013E": "The AUX I/O was set as a scope trigger and is now being set as a signal generator gating trigger. This is not allowed.",
  "0x0000013F": "The AUX I/O was set by the signal generator as a gating trigger and is now being set as a scope trigger. This is not allowed.",
  "0x00000140": "A resource has failed to initialise.",
  "0x00000141": "The temperature type is out of range.",
  "0x00000142": "A requested temperature type is not supported on this device.",
  "0x00000143": "A read/write to the device has timed out.",
  "0x00000144": "The device cannot be connected correctly.",
  "0x00000145": "The driver has experienced an unknown error and is unable to recover from this error.",
  "0x00000146": "Used when opening units via IP and more than multiple units have the same IP address.",
  "0x00000147": "Warning number of segments reduced",
  "0x00000148": "The calibration pin states argument is out of range.",
  "0x00000149": "The calibration pin frequency argument is out of range.",
  "0x0000014A": "The calibration pin amplitude argument is out of range.",
  "0x0000014B": "The calibration pin wavetype argument is out of range.",
  "0x0000014C": "The calibration pin offset argument is out of range.",
  "0x0000014D": "The probe's identity has a problem.",
  "0x0000014E": "The probe has not been identified.",
  "0x0000014F": "Enabling the probe would cause the device to exceed the allowable current limit.",
  "0x00000150": "The DC power supply is connected; enabling the probe would cause the device to exceed the allowable current limit.",
  "0x00000151": "Failed to complete probe configuration.",
  "0x00000152": "Failed to set the callback function, as currently in current callback function.",
  "0x00000153": "The probe has been verified but not known on this driver.",
  "0x00000154": "The intelligent probe cannot be verified.",
  "0x00000155": "The callback is null, probe collection will only start when first callback is a none null pointer.",
  "0x00000156": "The current drawn by the probe(s) has exceeded the allowed limit.",
  "0x00000157": "The channel range limits have changed due to connecting or disconnecting a probe the channel has been enabled.",
  "0x00000158": "Endpoint missing",
  "0x00000159": "Unknown endpoint request",
  "0x0000015A": "The ADC on board the device has not been correctly identified.",
  "0x0000015B": "Fpga2 failed",
  "0x0000015C": "Fpga2 device status",
  "0x0000015D": "Enable program fpga2 failed",
  "0x0000015E": "No channels or ports enabled",
  "0x0000015F": "Invalid ratio mode",
  "0x00000160": "Reads not supported in current capture mode",
  "0x00000161": "These selection tests can be masked together to show that mode than one read selection has failed the tests, therefore theses error codes cover 0x00000161UL to 0x0000016FUL.",
  "0x00000162": "Data read1 selection check failed",
  "0x00000164": "Data read2 selection check failed",
  "0x00000168": "Data read3 selection check failed",
  "0x00000170": "The requested read is not one of the reads available in enPicoReadSelection.",
  "0x00000171": "The downsample ratio options cannot be combined together for this request.",
  "0x00000172": "The enPicoReadSelection request has no samples available.",
  "0x00000173": "The enPicoReadSelection did not include one of the downsample ratios now requested.",
  "0x00000174": "No read requests have been made.",
  "0x00000175": "The parameter for <number of values> cannot be zero.",
  "0x00000176": "The analog hardware cannot be identified; contact Pico Technology Technical Support.",
  "0x00000177": "Setting of the analog hardware pins failed.",
  "0x00000178": "An SMPS fault has occurred.",
  "0x00000179": "There appears to be a conflict between the expected and actual hardware in the device; contact Pico Technology Technical Support.",
  "0x0000017A": "One or more of the enPicoRatioMode requested do not have a data buffer set.",
  "0x0000017B": "The resolution is valid but not supported by the opened device.",
  "0x0000017C": "The requested trigger threshold is out of range for the current device resolution.",
  "0x0000017D": "The simple trigger only supports upper edge direction options.",
  "0x0000017E": "The aux trigger is not supported on this variant.",
  "0x0000017F": "The trigger directions pointer may not be null.",
  "0x00000180": "The trigger channel properties pointer may not be null.",
  "0x00000181": "A trigger is set on a channel that has not been enabled.",
  "0x00000182": "A trigger condition has been set but a trigger property not set.",
  "0x00000183": "When requesting trigger data, this option can only be combined with the segment header ratio mode flag.",
  "0x00000184": "The trigger data buffer must be 40 or more samples in size.",
  "0x00000185": "The number of requested waveforms is greater than the number of memory segments allocated.",
  "0x00000186": "When requesting segment header information, the segment header does not require a data buffer, to get the segment information use GetTriggerInfo.",
  "0x00000187": "Use GetTriggerInfo to retrieve the segment header information.",
  "0x00000188": "A read request has not been set.",
  "0x00000189": "The expected and actual states of the ADCs do not match.",
  "0x0000018A": "The requested data type is not one of the enPicoDataType listed.",
  "0x0000018B": "The down sample ratio mode requested does not support the enPicoDataType option chosen.",
  "0x0000018C": "The channel combination is not valid for the resolution.",
  "0x0000018D": "Use 8bit resolution",
  "0x0000018E": "The buffer for minimum data values and maximum data values are the same buffers.",
  "0x0000018F": "The read request number of samples requested for an overlapped operation are more than the total number of samples to capture.",
  "0x00000190": "The overlapped read request has more segments specified than segments allocated.",
  "0x00000191": "The number of channel combinations available are greater than the array size received.",
  "0x00000192": "The number of captures is larger than the maximum number of segments allowed for the device variant.",
  "0x00000193": "The time unit requested is not one of the listed enPicoTimeUnits.",
  "0x00000194": "The number of samples parameter may not be zero.",
  "0x00000195": "The action requested is not listed in enPicoAction.",
  "0x00000196": "When adding buffers for the same read request the buffers for all ratio mode requests have to be the same size.",
  "0x00000197": "The data is being processed but there is no empty data buffers available, a new data buffer needs to be set sent to the driver so that the data can be processed.",
  "0x00000198": "when streaming data, only one read option is available.",
  "0x00000199": "A clear read request is not one of the enPicoAction listed.",
  "0x0000019A": "The combination of action flags are not allowed.",
  "0x0000019B": "PICO_ADD request has been made but both data buffers are set to null and so there is nowhere to put the data.",
  "0x0000019C": "A conflict between the data buffers being set has occurred. Please use the PICO_CLEAR_ALL action to reset.",
  "0x0000019D": "While processing data, buffers cannot be removed from the data buffers list.",
  "0x00000200": "An USB request has failed.",
  "0x00000201": "A request has been made to retrieve the latest streaming data, but with either a null pointer or an array size set to zero.",
  "0x00000202": "A buffer being set has a length that is invalid (ie less than zero).",
  "0x00000203": "The distribution size may not be zero.",
  "0x00000204": "The buffer length in bytes is greater than a 4-byte word.",
  "0x00000209": "The PLL has failed.",
  "0x0000020A": "Pulse width only supports one direction.",
  "0x0000020B": "There is no external trigger available on the device specified by the handle.",
  "0x0000020C": "The condition parameter is a null pointer.",
  "0x0000020D": "The number of trigger channel properties it outside the allowed range (is less than zero).",
  "0x0000020E": "A probe has been plugged into a channel, but can not be identified correctly.",
  "0x0000020F": "The probe is incompatible with the device channel it is connected to. This could lead to error in the measurements.",
  "0x00000210": "The requested channel for ETS triggering is not supported.",
  "0x00000211": "While the device is streaming the get values method is not available",
  "0x00000212": "the requested state is not one of the enSharedTriggerWithinPreTrigger values",
  "0x00000213": "the number of captures have to be greater than zero",
  "0x00000214": "the quantifier for a pointer, defining the length in bytes is invalid",
  "0x00000300": "the trigger delay is greater than supported by the hardware",
  "0x00000301": "the requested threshold direction is not allowed with the specified channel",
  "0x00000302": "the requested threshold mode is not allowed with the specified channel",
  "0x00000303": "The timebase is not supported or is invalid.",
  "0x00001000": "The device variant is not supported by this current driver.",
  "0x00001001": "The actual memory module does not match the expected memory module.",
  "0x00002000": "A null pointer has been passed in the trigger function or one of the parameters is out of range.",
  "0x00002001": "The pulse width qualifier type is not one of the listed options.",
  "0x00002002": "The pulse width qualifier direction is not one of the listed options.",
  "0x00002003": "The threshold range is not one of the listed options.",
  "0x00002004": "The trigger direction and pulse width option conflict with each other.",
  "0x00002005": "The thresholds upper limits and thresholds lower limits conflict with each other.",
  "0x00002006": "The pulse width lower count is out of range.",
  "0x00002007": "The pulse width upper count is out of range.",
  "0x00002008": "The devices front panel has caused an error.",
  "0x0000200B": "The actual and expected mode of the front panel do not match.",
  "0x0000200C": "A front panel feature is not available or failed to configure.",
  "0x0000200D": "When setting the pulse width conditions either the pointer is null or the number of conditions is set to zero.",
  "0x0000200E": "a trigger condition exists for a port, but the port has not been enabled",
  "0x0000200F": "a trigger condition exists for a port, but no digital channel directions have been set",
  "0x00002010": "I2c device invalid read command",
  "0x00002011": "I2c device invalid response",
  "0x00002012": "I2c device invalid write command",
  "0x00002013": "I2c device argument out of range",
  "0x00002014": "The actual and expected mode do not match.",
  "0x00002015": "While trying to configure the device, set up failed.",
  "0x00002016": "A feature is not available or failed to configure.",
  "0x00002017": "The device did not pass the validation checks.",
  "0x00002018": "Internal header error",
  "0x00002019": "The device couldn't write the channel settings due to a hardware fault",
  "0x00003000": "The number of MSO's edge transitions being set is not supported by this device (RISING, FALLING, or RISING_OR_FALLING).",
  "0x00003001": "A probe LED position requested is not one of the available probe positions in the ProbeLedPosition enum.",
  "0x00003002": "The LED position is not supported by the selected variant.",
  "0x00003003": "A channel has more than one of the same LED position in the ProbeChannelLedSetting struct.",
  "0x00003004": "Setting the probes LED has failed.",
  "0x00003005": "Probe is not supported by the selected variant.",
  "0x00003006": "The probe name is not in the list of enPicoConnectProbe enums.",
  "0x00003007": "The number of colour settings are zero or a null pointer passed to the function.",
  "0x00003008": "Channel has no probe connected to it.",
  "0x00003009": "Connected probe does not require calibration.",
  "0x0000300A": "Connected probe could not be calibrated - hardware fault is a possible cause.",
  "0x0000300B": "A probe has been connected, but the version is not recognised.",
  "0x0000300C": "The channel with the frequency counter enabled has a probe connected that does not support this feature",
  "0x00004000": "The requested trigger time is to long for the selected variant.",
  "0x00005000": "The MSO pod did not pass the validation checks.",
  "0x00005001": "No MSO pod found on the requested digital port.",
  "0x00005002": "the digital port enum value is not in the enPicoDigitalPortHysteresis declaration",
  "0x00005003": "Mso pod failed unit",
  "0x00005004": "The device's EEPROM is corrupt. Contact Pico Technology support: https://www.picotech.com/tech-support.",
  "0x00005005": "a channel set to the 50Ohm Path has Tripped due to the input signal",
  "0x00005006": "The MSO pod over current protection activated, unplug and replug the MSO pod",
  "0x00005010": "Status error for when the device has overheated.",
  "0x00005100": "The USB version of the port is not supported by this variant",
  "0x00006000": "waiting for the device to capture timed out",
  "0x00006001": "waiting for the device be ready for capture timed out",
  "0x00006002": "the driver is performing a capture requested by RunStreaming or RunBlock to interrupt this capture call Stop on the device first",
  "0x00007000": "the number of samples is less than the minimum number allowed",
  "0x00007001": "a streaming capture has been made but re-reading the data is not allowed",
  "0x00007002": "average and sum are classed as one aggregation type",
  "0x01000000": "The time stamp per waveform segment has been reset.",
  "0x02000001": "When requesting the TriggerTimeOffset the trigger time has not been set.",
  "0x02000002": "Trigger time buffer not set.",
  "0x02000004": "The trigger time failed to be calculated.",
  "0x02000008": "The trigger time failed to be calculated.",
  "0x02000100": "The trigger time stamp was not requested.",
  "0x02200000": "RATIO_MODE_TRIGGER_DATA_FOR_TIME_CALCULATION cannot have a buffer set",
  "0x02200001": "it is not possible to set a buffer for RATIO_MODE_TRIGGER_DATA_FOR_TIME_CALCULATION therefore information is not available pertaining to samples",
  "0x02200002": "to get the trigger time use either GetTriggerInfo or GetTriggerTimeOffset api calls",
  "0x02200003": "PICO_RATIO_MDOE_TRIGGER and RATIO_MODE_TRIGGER_DATA_FOR_TIME_CALCULATION is not supported in streaming capture",
  "0x02200004": "only the PICO_TRIGGER_READ may be used to read PICO_RATIO_MODE_TRIGGER, and PICO_RATIO_MODE_TRIGGER_FOR_CALCULATION",
  "0x02200005": "one of the PICO_DATA_READs should be used to read: PICO_RATIO_MODE_RAW PICO_RATIO_MODE_AGGREGATE PICO_RATIO_MODE_DECIMATE PICO_RATIO_MODE_AVERAGE",
  "0x02200006": "trigger data always requires a PICO_INT16_T data type",
  "0x02200007": "a ratio mode passed to the API call requires the number of samples to be greater than zero",
  "0x03000010": "Attempted to set up the signal generator with an inconsistent configuration.",
  "0x03000011": "The signal generator has been partially reconfigured and the new settings must be applied before it can be paused or restarted.",
  "0x03000012": "The wave type is not listed in enPicoWaveType.",
  "0x03000013": "The trigger type is not listed in enSigGenTrigType.",
  "0x03000014": "The trigger source is not listed in enSigGenTrigSource.",
  "0x03000015": "The filter state is not listed in enPicoSigGenFilterState.",
  "0x03000020": "The arbitrary waveform buffer is a null pointer.",
  "0x03000021": "The arbitrary waveform buffer length is zero.",
  "0x03000022": "The sig gen voltage offset and peak to peak have not been set.",
  "0x03000023": "The sig gen arbitrary waveform buffer not been set.",
  "0x03000024": "The sig gen frequency have not been set.",
  "0x03000025": "The sig gen sweep information has not been set.",
  "0x03000026": "The sig gen trigger information has not been set.",
  "0x03000027": "The sig gen clock frequency have not been set.",
  "0x03000030": "The sig gen arbitrary waveform buffer length is too long.",
  "0x03000031": "The duty cycle value is out of range.",
  "0x03000032": "The number of cycles is out of range.",
  "0x03000033": "The pre-scaler is out of range.",
  "0x03000034": "The sweep type is not listed in enPicoSweepType.",
  "0x03000035": "A mismatch has occurred while checking the sweeps wave type.",
  "0x03000036": "The sweeps or shots and trigger type are not valid when combined together.",
  "0x03000037": "The sweep and prescaler are not valid when combined together.",
  "0x03000038": "The potential applied to the AWG output exceeds the maximum voltage range of the AWG.",
  "0x03000039": "The reference signal cannot be locked to.",
  "0x03000040": "(Linux only.) udev rules are incorrectly configured. The user does not have read/write permissions on the device's file descriptor.",
  "0x03001000": "The digital ports without analog channels are only allowed in 8-bit resolution.",
  "0x03002000": "the adc is powered down when trying to capture data",
  "0x03003001": "Analogue frontend missing",
  "0x03003002": "Front panel missing",
  "0x03003003": "Analogue frontend and front panel missing",
  "0x03003800": "The digital board has reported an error to the driver",
  "0x03004000": "checking if the firmware needs updating the updateRequired parameter is null",
  "0x03004001": "Update required null",
  "0x03004002": "Firmware up to date",
  "0x03004003": "Flash fail",
  "0x03004004": "Internal error firmware length invalid",
  "0x03004005": "Internal error firmware null",
  "0x03004006": "Firmware failed to be changed",
  "0x03004007": "Firmware failed to reload",
  "0x03004008": "Firmware failed to be update",
  "0x03004009": "Firmware version out of range",
  "0x03005000": "Optional bootloader update available with this driver",
  "0x03005001": "Bootloader version not available",
  "0x03008000": "No apps available",
  "0x03008001": "Unsupported app",
  "0x10000000": "An internal error has occurred and a watchdog timer has been called.",
  "0x10000001": "The picoipp.dll has not been found.",
  "0x10000002": "A function in the picoipp.dll does not exist.",
  "0x10000003": "The Pico IPP call has failed.",
  "0x10000004": "Shadow calibration is not available on this device.",
  "0x10000005": "Shadow calibration is currently disabled.",
  "0x10000006": "Shadow calibration error has occurred.",
  "0x10000007": "The shadow calibration is corrupt.",
  "0x10000008": "The memory on board the device has overflowed.",
  "0x10000010": "The device Adc test failed.",
  "0x11000000": "Reserved 1",
  "0x20000000": "The PicoSource device is not ready to accept instructions.",
  "0x20000001": "Source invalid baud rate",
  "0x20000002": "Source not opened for write",
  "0x20000003": "Source failed to write device",
  "0x20000004": "Source eeprom fail",
  "0x20000005": "Source eeprom not present",
  "0x20000006": "Source eeprom not programmed",
  "0x20000007": "Source list not ready",
  "0x20000008": "Source ftd2xx not found",
  "0x20000009": "Source ftd2xx no function"
}